<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#La-connexion-à-la-base-de-données-PostgreSQL" data-toc-modified-id="La-connexion-à-la-base-de-données-PostgreSQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>La connexion à la base de données PostgreSQL</a></span></li><li><span><a href="#Les-regroupements" data-toc-modified-id="Les-regroupements-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Les regroupements</a></span><ul class="toc-item"><li><span><a href="#La-copy-d'un-DataFrame" data-toc-modified-id="La-copy-d'un-DataFrame-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>La copy d'un DataFrame</a></span></li><li><span><a href="#Le-groupby" data-toc-modified-id="Le-groupby-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Le groupby</a></span></li><li><span><a href="#Assign" data-toc-modified-id="Assign-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Assign</a></span></li></ul></li><li><span><a href="#Les-équijointures" data-toc-modified-id="Les-équijointures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Les équijointures</a></span></li><li><span><a href="#Les-jointures-externes" data-toc-modified-id="Les-jointures-externes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Les jointures externes</a></span></li></ul></div>

In [1]:
import pandas as pd 
import seaborn as sns
import warnings 
import os
import sqlalchemy
from matplotlib import pyplot as plt

from datetime import datetime
warnings.filterwarnings(action="ignore")

%matplotlib inline
%load_ext sql

plt.style.use('seaborn-darkgrid')
sns.set(font_scale=3)

# La connexion à la base de données PostgreSQL

**`postgresql://user:pass@host:port/dbname[?key=value&key=value...]`**<br>
**`engine = create_engine("postgresql://scott:tiger@localhost/test")`**<br>

In [2]:
engine = sqlalchemy.create_engine("postgresql://stagiaire:Phoenix#Icar67@51.91.76.248:15432/cours")
connection = engine.connect()
print(f"connecting with engine {engine}")

connecting with engine Engine(postgresql://stagiaire:***@51.91.76.248:15432/cours)

La lecture d'une table et le chargement dans un DataFrame

In [3]:
query = """
            select * 
            from categories
         """
categories = pd.read_sql_query(query, connection) #df.to_sql('nom', con=engine,if_exists='replace')
categories

,code_categorie,nom_categorie,description
0,1.0,Boissons,"Boissons, cafés, thés, bières"
1,2.0,Condiments,"Sauces, assaisonnements et épices"
2,3.0,Desserts,Desserts et friandises
3,4.0,Produits laitiers,Fromages
4,5.0,Pâtes et céréales,"Pains, biscuits, pâtes et céréales"
5,6.0,Viandes,Viandes préparées
6,7.0,Produits secs,"Fruits secs, raisins, autres"
7,8.0,Poissons et fruits de mer,"Poissons, fruits de mer, escargots"
8,9.0,Conserves,"Fruits, légumes en conserve et confitures"
9,10.0,Viande en conserve,Viande en conserve

# Les regroupements

In [4]:
query = """
            select co.no_commande, 
                   co.code_client, 
                   co.no_employe, 
                   co.date_commande,
                   cast(extract(year from co.date_commande) as int) annee, 
                   cast(extract(QUARTER from co.date_commande) as int) trimestre, 
                   cast(extract(month from co.date_commande) as int)  mois,
                   co.date_envoi, 
                   co.port, 
                   co.livree, 
                   co.acquitee, 
                   co.annulee, 
                   dc.ref_produit, 
                   dc.prix_unitaire, 
                   dc.quantite, 
                   dc.remise, 
                   dc.retourne,
                   echange 
            from commandes co 
                 join details_commandes dc 
                 on co.no_commande = dc.no_commande
            --FETCH FIRST 100 ROWS ONLY
         """
df = pd.read_sql_query(query, connection)
df.shape

(476091, 18)

## La copy d'un DataFrame

In [5]:
det_comm = df.copy()
det_comm.columns = [x.lower() for x in det_comm.columns]

In [6]:
det_comm.head()

,no_commande,code_client,no_employe,date_commande,annee,trimestre,mois,date_envoi,port,livree,acquitee,annulee,ref_produit,prix_unitaire,quantite,remise,retourne,echange
0,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,112.0,37.80,166.0,6.14,0.0,0.0
1,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,113.0,65.76,192.0,7.69,0.0,0.0
2,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,78.0,47.16,101.0,4.62,0.0,0.0
3,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,47.0,63.24,119.0,7.49,0.0,0.0
4,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,62.0,94.56,128.0,15.71,0.0,0.0

## Le groupby

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-03.png" width="400">

In [7]:
requete  = """  select extract(year from date_commande) annee, 
                       extract(QUARTER from date_commande) trimestre, 
                       extract(month from date_commande)  mois, 
                       sum(quantite) quantite_sum, 
                       avg(quantite) quantite_avg, 
                       sum(port) port_sum, 
                       min(port) port_min, 
                       max(port) port_max, 
                       avg(port) port_avg 
                from commandes co 
                   join details_commandes dc
                      on co.no_commande = dc.no_commande 
                group by extract(year from date_commande), 
                         extract(QUARTER from date_commande), 
                         extract(month from date_commande) 
                order by 1,2,3
            """
affichage = pd.read_sql_query(requete, connection)
affichage.head()

,annee,trimestre,mois,quantite_sum,quantite_avg,port_sum,port_min,port_max,port_avg
0,2010.0,1.0,1.0,2586939.0,110.524609,1768095.2,50.0,100.0,75.540255
1,2010.0,1.0,2.0,2422312.0,109.458292,1652843.4,50.1,100.0,74.687908
2,2010.0,1.0,3.0,2562429.0,109.693022,1737846.9,50.3,99.9,74.394131
3,2010.0,2.0,4.0,2413987.0,109.791559,1652110.2,50.0,100.0,75.140319
4,2010.0,2.0,5.0,2662399.0,109.320810,1815609.2,50.1,100.0,74.550760

In [8]:
det_comm.columns

Index(['no_commande', 'code_client', 'no_employe', 'date_commande', 'annee',
       'trimestre', 'mois', 'date_envoi', 'port', 'livree', 'acquitee',
       'annulee', 'ref_produit', 'prix_unitaire', 'quantite', 'remise',
       'retourne', 'echange'],
      dtype='object')

In [9]:
gb_dc = det_comm.groupby(['annee','trimestre','mois'])

In [10]:
gb_dc.agg({'quantite':['sum','mean'],'port':['sum','min','max','mean']}).head()

                       quantite                   port
                            sum        mean        sum   min    max       mean
annee trimestre mois
2010  1         1     2586939.0  110.524609  1768095.2  50.0  100.0  75.540255
                2     2422312.0  109.458292  1652843.4  50.1  100.0  74.687908
                3     2562429.0  109.693022  1737846.9  50.3   99.9  74.394131
      2         4     2413987.0  109.791559  1652110.2  50.0  100.0  75.140319
                5     2662399.0  109.320810  1815609.2  50.1  100.0  74.550760

In [11]:
gb_dc.agg({'prix_unitaire':'std'}).head()

                      prix_unitaire
annee trimestre mois
2010  1         1         16.981045
                2         16.987277
                3         17.012675
      2         4         17.048913
                5         16.992424

## Assign

In [12]:
df_dc = det_comm.assign(
                 ca_brut = det_comm.quantite*det_comm.prix_unitaire,
                 remise  = det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100,
                 ca_net  = det_comm.quantite*det_comm.prix_unitaire - 
                          (det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100)                
                ).groupby(
                          ['annee','trimestre','mois']
                         ).agg(
                               {'quantite':['sum','mean'],
                                'port'    :['sum','min','max','mean'],
                                'ca_brut' :['sum'],
                                'remise'  :['sum'],
                                'ca_net'  :['sum'],
                                 })
df_dc.head()

                       quantite                   port               \
                            sum        mean        sum   min    max
annee trimestre mois
2010  1         1     2586939.0  110.524609  1768095.2  50.0  100.0
                2     2422312.0  109.458292  1652843.4  50.1  100.0
                3     2562429.0  109.693022  1737846.9  50.3   99.9
      2         4     2413987.0  109.791559  1652110.2  50.0  100.0
                5     2662399.0  109.320810  1815609.2  50.1  100.0

                                      ca_brut        remise        ca_net
                           mean           sum           sum           sum
annee trimestre mois
2010  1         1     75.540255  1.698266e+08  1.487704e+07  1.549496e+08
                2     74.687908  1.585268e+08  1.379942e+07  1.447274e+08
                3     74.394131  1.677318e+08  1.466487e+07  1.530669e+08
      2         4     75.140319  1.577834e+08  1.379868e+07  1.439847e+08
                5     74.550760  1.743042e+08  1.526195e+07  1.590423e+08

In [13]:
df_dc.columns = [col[0]+'_'+col[1] for col in df_dc.columns]
df_dc.head()

                      quantite_sum  quantite_mean   port_sum  port_min  \
annee trimestre mois
2010  1         1        2586939.0     110.524609  1768095.2      50.0
                2        2422312.0     109.458292  1652843.4      50.1
                3        2562429.0     109.693022  1737846.9      50.3
      2         4        2413987.0     109.791559  1652110.2      50.0
                5        2662399.0     109.320810  1815609.2      50.1

                      port_max  port_mean   ca_brut_sum    remise_sum  \
annee trimestre mois
2010  1         1        100.0  75.540255  1.698266e+08  1.487704e+07
                2        100.0  74.687908  1.585268e+08  1.379942e+07
                3         99.9  74.394131  1.677318e+08  1.466487e+07
      2         4        100.0  75.140319  1.577834e+08  1.379868e+07
                5        100.0  74.550760  1.743042e+08  1.526195e+07

                        ca_net_sum
annee trimestre mois
2010  1         1     1.549496e+08
                2     1.447274e+08
                3     1.530669e+08
      2         4     1.439847e+08
                5     1.590423e+08

In [14]:
df_dc.reset_index().head()

,annee,trimestre,mois,quantite_sum,quantite_mean,port_sum,port_min,port_max,port_mean,ca_brut_sum,remise_sum,ca_net_sum
0,2010,1,1,2586939.0,110.524609,1768095.2,50.0,100.0,75.540255,1.698266e+08,1.487704e+07,1.549496e+08
1,2010,1,2,2422312.0,109.458292,1652843.4,50.1,100.0,74.687908,1.585268e+08,1.379942e+07,1.447274e+08
2,2010,1,3,2562429.0,109.693022,1737846.9,50.3,99.9,74.394131,1.677318e+08,1.466487e+07,1.530669e+08
3,2010,2,4,2413987.0,109.791559,1652110.2,50.0,100.0,75.140319,1.577834e+08,1.379868e+07,1.439847e+08
4,2010,2,5,2662399.0,109.320810,1815609.2,50.1,100.0,74.550760,1.743042e+08,1.526195e+07,1.590423e+08

# Les équijointures

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/612.png" width="800">

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [15]:
pd.read_sql_query("select count(*) from employes", connection)

   count
0    111

In [16]:
pd.read_sql_query("select count(*) from commandes ", connection)

   count
0  13462

In [17]:
pd.read_sql_query("select count(*) from clients", connection)

   count
0     91

In [18]:
pd.read_sql_query("""select count(*) 
                     from employes em 
                              inner join commandes co 
                                   on em.no_employe = co.no_employe 
                              inner join clients cl 
                                   on cl.code_client = co.code_client""", connection)

   count
0  13462

In [19]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection)
clients  = pd.read_sql_query("select * from clients",connection)

In [20]:
employes.head()

,no_employe,rend_compte,nom,prenom,fonction,titre,date_naissance,date_embauche,salaire,commission,pays,region
0,37.0,NaN,Giroux,Jean-Claude,Président,M.,1979-04-28,2002-03-08,150000.0,NaN,None,None
1,14.0,37.0,Fuller,Andrew,Vice-Président,M.,1984-06-27,2003-08-09,96000.0,NaN,None,Amériques
2,18.0,37.0,Brasseur,Hervé,Vice-Président,M.,1980-05-29,2001-10-26,147000.0,NaN,None,Europe
3,24.0,14.0,Buchanan,Steven,Chef des ventes,M.,1972-11-26,1995-02-09,13000.0,12940.0,None,Amérique du Nord
4,95.0,18.0,Leger,Pierre,Chef des ventes,M.,1989-09-01,2002-09-07,19000.0,11150.0,None,Europe du Nord

In [21]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').shape

(13462, 27)

In [22]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').head()

,no_employe,rend_compte,nom,prenom,fonction,titre,date_naissance,date_embauche,salaire,commission,...,livree,acquitee,annulee,societe,adresse,ville,code_postal,pays_y,telephone,fax
0,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
1,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,1.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
2,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
3,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
4,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None

# Les jointures externes 

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [23]:
pd.read_sql_query("select count(*) from employes", connection)

   count
0    111

In [24]:
pd.read_sql_query("select count(*) from commandes", connection)

   count
0  13462

In [25]:
pd.read_sql_query("""select count(*) lignes,
                            count(distinct em.no_employe) as emp_employes ,
                            count(distinct co.no_employe) as emp_commandes 
                     from employes em 
                                  left outer join commandes co 
                                       on em.no_employe = co.no_employe""", connection)

   lignes  emp_employes  emp_commandes
0   13481           111             92

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-08.png" width="400">

In [26]:
pd.read_sql_query("""
                        select em.no_employe,
                               sum(port) port
                        from employes em 
                          left outer join commandes co 
                               on em.no_employe = co.no_employe 
                        group by em.no_employe 
                        order by port nulls first fetch next 25 rows only
""", connection)

    no_employe    port
0         23.0     NaN
1         44.0     NaN
2         24.0     NaN
3         27.0     NaN
4         89.0     NaN
5         18.0     NaN
6        104.0     NaN
7         57.0     NaN
8        109.0     NaN
9         33.0     NaN
10        64.0     NaN
11        11.0     NaN
12        37.0     NaN
13        14.0     NaN
14        30.0     NaN
15        21.0     NaN
16        75.0     NaN
17        86.0     NaN
18        95.0     NaN
19         8.0  1503.1
20        82.0  1609.8
21        76.0  1625.2
22        36.0  1770.3
23        61.0  1943.9
24        34.0  2159.7

In [27]:
pd.read_sql_query("""
                        select 
                            count(*),
                            count(distinct em.no_employe),
                            count(distinct co.no_employe) 
                        from employes em 
                          left outer join commandes co 
                               on em.no_employe = co.no_employe 
                        where extract(year from co.date_commande) = 2010
""", connection)

   count  count  count
0   7969     92     92

Toutefois la requête précédente ne retourne pas les employés qui n’ont pas passé de commande, car la condition ``annee = 2010`` impose également l’existence d’un enregistrement dans la table **COMMANDES**.

In [28]:
pd.read_sql_query("""
                        select count(*),
                            count(distinct em.no_employe),
                            count(distinct co.no_employe) 
                        from employes em 
                          left outer join commandes co 
                               on em.no_employe = co.no_employe 
                        where coalesce(extract(year from co.date_commande),2010) = 2010
""", connection)

   count  count  count
0   7988    111     92

In [29]:
pd.read_sql_query("""
                        select count(*),
                             count(distinct em.no_employe),
                             count(distinct co.no_employe) 
                             from employes em 
                                  left outer join commandes co 
                                       on em.no_employe = co.no_employe 
                                  left join clients cl 
                                       on cl.code_client = co.code_client
""", connection)

   count  count  count
0  13481    111     92

In [30]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection).drop(columns=['pays','region'])
clients  = pd.read_sql_query("select * from clients",connection)

In [31]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='inner').shape

(13462, 17)

In [32]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='left').shape

(13481, 17)

Avec join c'est un peut casse tête à mon avis

In [33]:
employes.set_index(
                   'no_employe'
                   ).join(
                          commandes.set_index(
                                              'no_employe'
                                              ),
                           how='left'
                          ).reset_index().set_index(
                                                    'code_client'
                                                   ).join(
                                                          clients.set_index(
                                                                            'code_client'
                                                                            ),
                                                          how='left').shape

(13481, 24)

In [34]:
employes.merge(commandes,on='no_employe',how='left').merge(clients,on='code_client',how='left').shape

(13481, 25)